#Трикутник задається координатами своїх вершин на площині. Визначити, чи є цей трикутник рівнобедреним
print("Введіть перші координати:")
x1 = int(input())
y1 = int(input())
print("Введіть другі координати:")
x2 = int(input())
y2 = int(input())
print("Введіть треті координати:")
x3 = int(input())
y3 = int(input())
a = ((x2-x1)**2+(y2-y1)**2)**(1/2)
b = ((x2-x3)**2+(y2-y3)**2)**(1/2)
c = ((x3-x1)**2+(y3-y1)**2)**(1/2)
if a**2 == b**2 or b**2 == c**2 or a**2 == c**2:
    print("riv")
else:
    print("ne riv")
